# https://open.163.com/movie/2012/11/I/D/M8GAJA3DR_M8JMN2JID.html
## 一、企业设立、经营与财务报表 
# 实力、能力、活力 # 底子、面子（造假）、日子
# 资产assets、负债liability、股东权益shareholders's equity = 净资产net assets
# 1. 资产负债表（具体时间：时期）
资产 = 负债 + 股东权益 # 能用货币表现的企业资源, 是全部资源的一部分（商誉、人力）
资产 = 流动资产 + 非流动资产
股东权益 = 股东入资 + 利润积累 + 非利润资产变化
# 按流动性分类
流动资产 = 货币 + 债权 + 存货 # 一年（或一个经营周期）内可以转化为货币的资产
非流动资产 =  投资 + 固定 + 无形 # 一年以上（长期）可以转化为货币的资产
# 按利润贡献方式分类
经营资产 = 货币 + 债权 + 存货 + 固定 + 无形
投资资产 = 可供出售金融资产 + 持有至到期资产 + 长期股权投资 （交易性金融资产）
# 资源的权益归属 = 债权人（负债） + 股东（股东所有者权益）
实收资本（公司上市称为股本）
# 2.利润表（具体时间：年）反映企业盈亏状况
收入 - 费用 = 净利润
收入 = 营业收入 + 营业外收入 + 投资收入 + 公允价值变动损益
# 3. 现金流量表：货币资金的收支情况
现金流量净值 = 经营活动 + 投资活动 + 筹资活动
现金流入量 - 现金流出量 = 现金流量净值

## 二、企业设立、经营与财务报表
股东利润的展开说明：盈余公积、未分配利润
股东入资三重效应：为经营奠定基础，对潜在的债务提供保证（重视非现金入资），建立股东之间的利益关系

## 三、企业发展、扩张与财务报表
企业发展：自主经营 + 对外控制性投资（长期股权投资）
扩张的资金来源（累积可动用货币资金和筹资）
扩张的资金投向（无形资产、固定资产、在建工程）
在建工程：时间过长时，单位产能成本过高；未来投资决策不确定。此时，资产负债表在利润表无法体现出来。
# （重要）识别对外控制性投资
本公司的长期股权投资 - 合并报表（包括子公司）的长期股权投资 = 对外控制性投资（成立子公司的股东权益）
本公司其他应收账款 - 合并报表（包括子公司）的其他应收账款 = 对外控制投资投资（给予子公司经营的资金）
对外扩张总投资 = 以上两者之和
合并报表总资产 - 本公司总资产 = 撬动的总资金量
合并报表与本公司报表看公司扩张效应。 
# 控制性投资效益的体现
合并报表净利润 - 本公司净利润 = 控制性投资（子公司总体）净利润
子公司不分红，体现在子公司净利润；分红，则体现为（本公司）投资收益

## 四、从财务报表看战略
构建固定资产、无形资产和其他长期资产支付的现金：自主经营
投资支付的现金：对外投资扩张
# 1. 行业的选择和定位
不同行业的资产结构差异
定位：资源、产品定位与市场占有率（营业额）
扩张战略及效应
视角（全体股东：资源的系统性优化、变化的盈利导向；控制性股东的视角：资产转移）
# 具体
决定基本的资产结构：固定资产和存货的关系，货币资金、其他应收款（对外提供资金）、长期股权投资
传统经营五大项：货币、债券、存货、固定、无形
固定资产大，存货很大：可能是制造业
# 扩张战略及效应
对内扩大经营及效应
对外控制性投资（撬动效应以外的）效应：资产盘活效应、风险分散效应

# 五、从财务报表看竞争力
核心竞争力：比较优势
企业竞争力的财务报表表现：持续的盈利能力、现金获取能力
# 应收账款周转率 = 营业收入/平均应收账款（次数）
# 上下游关系
上下游关系管理（经营性流动资产：预付款项、应收票据、应收账款、存货；负债：应付票据、应付账款、应收款项）
营业收入：应收票据、应收账款（表上已减去坏账）、预收款项
年初和年末的 应收账款 + 应收票据 ~ 预收款项（应收票据无法收回变成应收账款）# 收款
年初和年末的预付款项 + 存货 ~ 应付票据 + 应付账款 # 付款
# 市场竞争力
毛利、毛利率与竞争力
# 核心利润 = 毛利 - 营业税及附加 - 销售费用- 管理费用 - 财务费用
核心利润、核心利润率与竞争力
资产报酬率 return on assets、资产报酬额 return of asset(额)
总资产报酬率 = 息税前利润/平局资产总额*100%
净资产（资产 - 负债）收益率（净利润/平均净资产*100%） # 对股东

## 六、从财务报表看效益及质量
利润表：营业收入、公允价值变动收益、投资收益、营业外收入
毛利 = 营业收入 - 营业成本
营业利润：两大支柱（核心利润、投资收益）
利润总额：三大支柱（核心利润、投资收益、营业外收入如政府补贴）
母公司报表净利润：企业分红的基础
合并报表的净利润：评估企业集团的营业能力
归属于母公司所有者的净利润：观念的价值量
# 利润质量
1. 营业收入的规模和结构的变化
规模：年度间营业额的规模变化
结构：持续营业能力、企业竞争优势（未来市场预期）
2. 毛利率变化
3. 费用额和费用率的变化
4. 资产减值损失：相应资产的管理质量
5. 投资收益
6. 营业外收入（政策的持续性）
# 在制造业里，存货积压将导致当期毛利的提高
存货积压：管理失当引起的实物积压、利润操纵的账面积压 # 积压：超过正常需求的增加 # 未来亏损主因
核心利润 * （1.2~1.5） ~= 经营活动的现金流量 # 一年内存货周转大于2次的 经验判断

## 七、从财务报表看风险
# 可计算：经营风险、财务风险
# 1. 经营风险：与未来盈利能力不确定相关性的各项因素，相关比率
流动资产和流动负债的关系（核心是上下游关系管理），毛利率，核心利润率，存货周转率
# 2. 财务风险：贷款融资的风险
资产负债率 = 负债/总资产 (>70%财务风险比较大)
预收款项较高，不属于财务风险。
# 3. 股权结构、公司治理与核心人物变更风险
股权结构的集中、分散
股东大会、董事会及企业管理层的关系
# 4. 惯性依赖风险：市场环境
# 5. 竞争环境变化风险：竞争地位、政策变化、替代品出现

# 八、从财务报表看前景 # 从历史看前景有其弊端
# 从资产结构
（资源与能力）经营资产：存货、固定资产产生（市场与效益：利润表的营业收入）核心利润（质量：现金流量表的经营活动产生的净现金流入量）
利润高，没有现金流量，则应收账款、存量增加
从控制性投资看前景：重要因素（特定地域环境变化：地域结构布局；少数股东对企业的影响）
# 从利润结构
核心利润（主营业务竞争力）、投资收益、营业外收入
# 从融资、重组
资产重组：改变结构，提高利润
债务重组：改变条件，缓解压力
资本重组（内部）、资本重组（企业间如合并）
# 扩张的基础：资金、人力、市场
人力资源管理：激励、薪酬、人力资源周转率
# 从行业变化看前景
政策、技术